#define CHAR_ARROW_RIGHT_FILLED			166                         //Символ закрашенного треугольника вправо |>

// Массив надписей меню ПДК из 12 символов
const unsigned char PROGMEM nadp_mPDK[31][12]= {
	"Абрикос   60",
	"Арбуз     60",
	"Банан    200",
	"Баклажан 300",
	"Виноград  60",
	"Груша     60",
	"Зелень  2000",
	"Дыня      90",
	"КапустаР 900",
	"КапустаП 500",
	"Кабачок  400",
	"Картофель250",
	"Клубника 100",
	"Лук репч. 80",
	"Лук зел. 600",
	"Манго     60",
	"МорковьР 400",
	"МорковьП 250",
	"Мясо св. 200",
	"Нектарин  60",
	"Огурец   300",
	"Перец сл.200",
	"Персик    60",
	"Помидор  250",
	"Редис   1500",
	"Редька  1000",
	"Салат   1200",
	"Свекла  1400",
	"Хурма     60",
	"Яблоко    60",
	"Прочее   200"
};

const uint8_t PROGMEM STR_MAIN_MENU_MEASSURE[] = "Измерение  \xA5";
const uint8_t PROGMEM STR_MAIN_MENU_SETTINGS[] = "Настройки  \xA5";
const uint8_t PROGMEM STR_MAIN_MENU_LIMITS[] = "Нормы ПДК  \xA5";

const uint8_t PROGMEM STR_UAKK_V[] = "Uакк,В";
const uint8_t PROGMEM STR__V[] = " В";


// Массив надписей из 10 символов
const unsigned char PROGMEM nadp_10[15][10]= {
	"Измерение ",                          //0	!!
	"Настройки ",                          //1	!!
	"Нормы ПДК ",                          //2	!!
	" ПРОДУКТ: ",                          //3
	" НАСТРОЙКИ",                          //4
	"КАЛИБРОВКА",                          //5
	"          ",                          //6
	"Сохранить ",                          //7
	"Сохранено ",                          //8
	"Очистить  ",                          //9
	"статистику",                          //10
	"Ред.назван",                          //11
	"Очистить? ",                          //12
	"Да     Нет",                          //13
	"РЕД.НАЗВАН",                          //14
};

/*Массив надписей сообщений из 11 символов*/
const unsigned char PROGMEM nadpis_mes[9][11]= { 
	"           ",                         //0
	"Аккумулятор",                         //1
	" разряжен! ",                         //2
	" заряжен!  ",                         //3
	"Выключение!",                         //4
	"Статистика ",                         //5
	" очищена!  ",                         //6
	"  Замер    ",                         //7
	" сохранён! ",                         //8
};
// Массив надписей из 8 символов
const unsigned char PROGMEM nadp_8[8][8]= { 
	"T подсв.",                            //0
	"Яркость ",                            //1
	"Таймер  ",                            //2
	"Звук    ",                            //3
	"Контраст",                            //4
	"Замеров ",                            //5
	"Gx,мкСм ",                            //6
	"Нормы ПД",                            //7
};

// Массив надписей из 6 символовs
const unsigned char PROGMEM nadp_6[8][6]= {
	"Замер ",                              //0
	"Макс. ",                              //1
	"Мин.  ",                              //2
	"Uакк. ",                              //3
	"Uакк,В",                              //4	!!!
	"Rx,Ом ",                              //5
	"(мкСм)",                              //6
	" мкСм ",                              //7
};

// Массив надписей из 4 символов
const unsigned char PROGMEM nadp_4[15][4]= { 
	"Выкл",                                //0
	"1мин",                                //1
	"2мин",                                //2
	"3мин",                                //3
	"5мин",                                //4
	" ---",                                //5
	" 10с",                                //6
	" 15с",                                //7
	" 20с",                                //8
	" 30с",                                //9
	" 45с",                                //10
	" 60с",                                //11
	"К,мг",                                //12
	"Выкл",                                //13
	"Вкл.",                                //14
};

